hotroom/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    IN
    {
        type            wall;
        inGroups        1(wall);
        nFaces          551;
        startFace       1179294;
    }
    OUT
    {
        type            wall;
        inGroups        1(wall);
        nFaces          551;
        startFace       1179845;
    }
    WALL
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40640;
        startFace       1180396;
    }
)

// ************************************************************************* //
